// arraynew.cpp -- использование операции new для массивов
#include <iostream>

int main() {
	using namespace std;
	double * p3 = new double[3];			// пространство для 3 значений double
	p3[0] = 0.2;					// трактовать p3 как имя массива
	p3[1] = 0.5;
	p3[2] = 0.8;
	cout << "p3[1] is " << p3[1] << ".\n";		// вывод p3[1]
	p3 = p3 + 1;					// увеличение указателя
	cout << "Now p3[0] is " << p3[0] << " and ";	// вывод p3[0]
	cout << "p3[1] is " << p3[1] << ".\n";		// вывод p3[1]
	p3 = p3 - 1;					// возврат указателя в начало
	delete [] p3;					// освобождение памяти
	return 0;
}
