/*
* task01.cpp
* "Язык программирования C++ (6 издание), Стивен Прата
* Глава 2: Приступаем к изучению C++, Упражнения по программированию (Задача 1):
* Напишите программу на C++, которая отобразит ваше имя и адрес (можете указать фиктивные данные).
*/
#include <iostream>

int main() {
	using namespace std;
	cout << "My name is Sherlock Holmes " << endl;
	cout << "My address is Great Britain,Baker Street, 221b";
	return 0;
}
